docs/howto/binding.org
** What translators do

A binding results in values being copied back and forth between the view and
the view-model.  However, sometimes a little bit of work needs to be done in
addition to the copying.  For example, one common task is converting the
string value contained by the view to a different data type for use in the
model, or vice-versa.

To perform these sorts of tasks we use /translators/.  Inspired by Microsoft's
[[https://rx.codeplex.com/][reactive extensions]], these are objects that can
be inserted in between the view and the view-model and can operate on values
as they are passed from one to the other.  Think of a chain of people passing packages
from one destination to another.  Each person receives packages from the
person behind him, has an opportunity to modify it, and then passes
it to the next person in line.

Every binding can potentially have two translators.  The translator labeled
~toView~ in the binding specification is responsible for translating from the
value used by the model to the value used by the view; the translator labeled
~toModel~ in the binding specification is responsible for translating from the
value used by the view to the value used by the model.

** Chaining translators

The HotDrink binders assume there will at most one translator from the view to
the view-model, and at most one translator from the view-model to the view.
However, you can easily sneak in multiple translators by wrapping them in a
chain translator.  A chain encapsulates a sequence of translators, making them
look like a single translator.  When it receives a value, it translates it by
running it through all the translators it contains.  Whatever is produced by
the final translator becomes the value produced by the chain.

You can see chains used in the following binding.

#+NAME: chain
#+BEGIN_SRC js
  hd.bind( {view: new hd.Edit( document.getElementById( 'b_edit' ) ),
            model: model.b, (ref:chain)
            toModel: hd.chain( hd.toNum(),
                               hd.round( 0 ),
                               hd.scale( 0.01 ) ),
            toView: hd.chain( hd.scale( 100 ),
                              hd.fix( 0 )      ),
           }
         );
#+END_SRC

However, as a convenience to you, if the ~bind~ function finds that you have
passed an array as either ~toView~ or ~toModel~, it will use the contents of
the array to create a chain.  This is simply a shortcut to make binding
specifications a bit shorter.  You can see this shortcut is used in the
following binding.

#+NAME: array
#+BEGIN_SRC js
  hd.bind( {view: new hd.Edit( document.getElementById( 'd_edit' ) ),
            model: model.d,
            toModel: [hd.toDate(), hd.dateToMilliseconds()],
            toView: [hd.toDate(), hd.dateToDateString()]
           }
         );
#+END_SRC

** When translators fail

As mentioned previously, translators pass a value from one to the next until it
reaches the variable.  It is possible, however, for some translators to fail.
For example, the translator which translates a string to a number will fail if
the string does not parse as a valid number.  If an translator fails, then it
produces an error value which will be passed along in place of the value for
the variable.  For example, all translators provided by HotDrink produce a
string containing an error message.

Most translators simply pass along error values without modifying them.  It is
possible, however, for an translator to modify the error value, or even convert
the error value back into a variable value (see [[msg][msg]] and [[def][def]].)  If an error
value reaches the variable, it will be stored in the variable's ~error~
property, and the variable's value will not be changed.  If a valid value
reaches the variable, then the variable's ~error~ property will be set to
~null~.

The ~error~ property can be bound to the view, allowing the error to be
displayed.  For more information, see the section "[[* Binding to variable properties][Binding to variable
properties]]").


** List of translators

Here are the translators provided by HotDrink.


*** ~toNum~

Converts a value to number using JavaScript's ~Number~ constructor.  Fails if the
result is ~NaN~.

*** ~toDate~

Converts a value to a ~Date~ object using JavaScript's ~Date~ constructor.  Fails if
the resulting date's ~getTime~ method returns ~NaN~.

*** ~toStr~

Converts any value to string by invoking its ~toString~ method.  Generally
not needed, as JavaScript will automatically do this any time it needs to
coerce a value to string.

*** ~toJson~

Converts any value to string by invoking ~JSON.stringify~.

*** ~dateToString~

Converts a date object to a string using it's ~toLocaleString~ method.

*** ~dateToDateString~

Converts a date object to a string using it's ~toLocaleDateString~ method.


*** ~dateToTimeString~

Converts a date object to a string using it's ~toLocaleTimeString~ method.


*** ~dateToMilliseconds~

Converts a date object to a number of milliseconds using its ~getTime~ method.

*** ~fix( places )~

Converts a number to a string containing the specified number of places after
the decimal point using JavaScript's ~Number.toFixed~.

*** ~prec( sigfigs )~

Converts a number to a string containing the specified number of significant
figures using JavaScript's ~Number.toPrecision~.

*** ~exp( places )~

Converts a number to a string in scientific notation using the specified
number of digits after the decimal point using JavaScript's ~Number.toExponential~.

*** ~round( places )~

Rounds a number to specified number of digits after the decimal point.  Note
that this is different from ~fix~ because it produces a number, not a string.

*** ~scale( factor )~

Scales a number by a constant factor.

*** ~stabilize( time_ms )~

Wait specified number of milliseconds before passing along value; only pass
along if no other value arrives in that time period.  Does not modify the
value.

*** ~req()~

Results in error if value is ~undefined~, ~null~, or empty string.

*** <<def>> ~def( value )~

Replaces ~undefined~, ~null~, empty string, or error with given value.

*** <<msg>> ~msg( value )~

Replaces error with given value; can be used to customize error messages.

