howto/binding.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> What translators do</h3>
<div class="outline-text-3" id="text-1-2">
<p>
A binding results in values being copied back and forth between the view and
the view-model.  However, sometimes a little bit of work needs to be done in
addition to the copying.  For example, one common task is converting the
string value contained by the view to a different data type for use in the
model, or vice-versa.
</p>

<p>
To perform these sorts of tasks we use <i>translators</i>.  Inspired by Microsoft's
<a href="https://rx.codeplex.com/">reactive extensions</a>, these are objects that can
be inserted in between the view and the view-model and can operate on values
as they are passed from one to the other.  Think of a chain of people passing packages
from one destination to another.  Each person receives packages from the
person behind him, has an opportunity to modify it, and then passes
it to the next person in line.
</p>

<p>
Every binding can potentially have two translators.  The translator labeled
<code>toView</code> in the binding specification is responsible for translating from the
value used by the model to the value used by the view; the translator labeled
<code>toModel</code> in the binding specification is responsible for translating from the
value used by the view to the value used by the model.
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Chaining translators</h3>
<div class="outline-text-3" id="text-1-3">
<p>
The HotDrink binders assume there will at most one translator from the view to
the view-model, and at most one translator from the view-model to the view.
However, you can easily sneak in multiple translators by wrapping them in a
chain translator.  A chain encapsulates a sequence of translators, making them
look like a single translator.  When it receives a value, it translates it by
running it through all the translators it contains.  Whatever is produced by
the final translator becomes the value produced by the chain.
</p>

<p>
You can see chains used in the following binding.
</p>

<div class="org-src-container">

<pre class="src src-js" id="chain">  hd.bind( {view: <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'b_edit'</span> ) ),
<span id="coderef-chain" class="coderef-off">            model: model.b, (chain)</span>
            toModel: hd.chain( hd.toNum(),
                               hd.round( 0 ),
                               hd.scale( 0.01 ) ),
            toView: hd.chain( hd.scale( 100 ),
                              hd.fix( 0 )      ),
           }
         );
</pre>
</div>

<p>
However, as a convenience to you, if the <code>bind</code> function finds that you have
passed an array as either <code>toView</code> or <code>toModel</code>, it will use the contents of
the array to create a chain.  This is simply a shortcut to make binding
specifications a bit shorter.  You can see this shortcut is used in the
following binding.
</p>

<div class="org-src-container">

<pre class="src src-js" id="array">  hd.bind( {view: <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.Edit</span>( document.getElementById( <span style="color: #008000;">'d_edit'</span> ) ),
            model: model.d,
            toModel: [hd.toDate(), hd.dateToMilliseconds()],
            toView: [hd.toDate(), hd.dateToDateString()]
           }
         );
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> When translators fail</h3>
<div class="outline-text-3" id="text-1-4">
<p>
As mentioned previously, translators pass a value from one to the next until it
reaches the variable.  It is possible, however, for some translators to fail.
For example, the translator which translates a string to a number will fail if
the string does not parse as a valid number.  If an translator fails, then it
produces an error value which will be passed along in place of the value for
the variable.  For example, all translators provided by HotDrink produce a
string containing an error message.
</p>

<p>
Most translators simply pass along error values without modifying them.  It is
possible, however, for an translator to modify the error value, or even convert
the error value back into a variable value (see <a href="#msg">msg</a> and <a href="#def">def</a>.)  If an error
value reaches the variable, it will be stored in the variable's <code>error</code>
property, and the variable's value will not be changed.  If a valid value
reaches the variable, then the variable's <code>error</code> property will be set to
<code>null</code>.
</p>

<p>
The <code>error</code> property can be bound to the view, allowing the error to be
displayed.  For more information, see the section "<a href="#sec-4">Binding to variable
properties</a>").
</p>
</div>
</div>


<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> List of translators</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Here are the translators provided by HotDrink.
</p>
</div>


<ol class="org-ol"><li><a id="sec-1-5-1"></a><code>toNum</code><br  /><div class="outline-text-4" id="text-1-5-1">
<p>
Converts a value to number using JavaScript's <code>Number</code> constructor.  Fails if the
result is <code>NaN</code>.
</p>
</div>
</li>

<li><a id="sec-1-5-2"></a><code>toDate</code><br  /><div class="outline-text-4" id="text-1-5-2">
<p>
Converts a value to a <code>Date</code> object using JavaScript's <code>Date</code> constructor.  Fails if
the resulting date's <code>getTime</code> method returns <code>NaN</code>.
</p>
</div>
</li>

<li><a id="sec-1-5-3"></a><code>toStr</code><br  /><div class="outline-text-4" id="text-1-5-3">
<p>
Converts any value to string by invoking its <code>toString</code> method.  Generally
not needed, as JavaScript will automatically do this any time it needs to
coerce a value to string.
</p>
</div>
</li>

<li><a id="sec-1-5-4"></a><code>toJson</code><br  /><div class="outline-text-4" id="text-1-5-4">
<p>
Converts any value to string by invoking <code>JSON.stringify</code>.
</p>
</div>
</li>

<li><a id="sec-1-5-5"></a><code>dateToString</code><br  /><div class="outline-text-4" id="text-1-5-5">
<p>
Converts a date object to a string using it's <code>toLocaleString</code> method.
</p>
</div>
</li>

<li><a id="sec-1-5-6"></a><code>dateToDateString</code><br  /><div class="outline-text-4" id="text-1-5-6">
<p>
Converts a date object to a string using it's <code>toLocaleDateString</code> method.
</p>
</div>
</li>


<li><a id="sec-1-5-7"></a><code>dateToTimeString</code><br  /><div class="outline-text-4" id="text-1-5-7">
<p>
Converts a date object to a string using it's <code>toLocaleTimeString</code> method.
</p>
</div>
</li>


<li><a id="sec-1-5-8"></a><code>dateToMilliseconds</code><br  /><div class="outline-text-4" id="text-1-5-8">
<p>
Converts a date object to a number of milliseconds using its <code>getTime</code> method.
</p>
</div>
</li>

<li><a id="sec-1-5-9"></a><code>fix( places )</code><br  /><div class="outline-text-4" id="text-1-5-9">
<p>
Converts a number to a string containing the specified number of places after
the decimal point using JavaScript's <code>Number.toFixed</code>.
</p>
</div>
</li>

<li><a id="sec-1-5-10"></a><code>prec( sigfigs )</code><br  /><div class="outline-text-4" id="text-1-5-10">
<p>
Converts a number to a string containing the specified number of significant
figures using JavaScript's <code>Number.toPrecision</code>.
</p>
</div>
</li>

<li><a id="sec-1-5-11"></a><code>exp( places )</code><br  /><div class="outline-text-4" id="text-1-5-11">
<p>
Converts a number to a string in scientific notation using the specified
number of digits after the decimal point using JavaScript's <code>Number.toExponential</code>.
</p>
</div>
</li>

<li><a id="sec-1-5-12"></a><code>round( places )</code><br  /><div class="outline-text-4" id="text-1-5-12">
<p>
Rounds a number to specified number of digits after the decimal point.  Note
that this is different from <code>fix</code> because it produces a number, not a string.
</p>
</div>
</li>

<li><a id="sec-1-5-13"></a><code>scale( factor )</code><br  /><div class="outline-text-4" id="text-1-5-13">
<p>
Scales a number by a constant factor.
</p>
</div>
</li>

<li><a id="sec-1-5-14"></a><code>stabilize( time_ms )</code><br  /><div class="outline-text-4" id="text-1-5-14">
<p>
Wait specified number of milliseconds before passing along value; only pass
along if no other value arrives in that time period.  Does not modify the
value.
</p>
</div>
</li>

<li><a id="sec-1-5-15"></a><code>req()</code><br  /><div class="outline-text-4" id="text-1-5-15">
<p>
Results in error if value is <code>undefined</code>, <code>null</code>, or empty string.
</p>
</div>
</li>

<li><a id="sec-1-5-16"></a><a id="def"></a> <code>def( value )</code><br  /><div class="outline-text-4" id="text-1-5-16">
<p>
Replaces <code>undefined</code>, <code>null</code>, empty string, or error with given value.
</p>
</div>
</li>

<li><a id="sec-1-5-17"></a><a id="msg"></a> <code>msg( value )</code><br  /><div class="outline-text-4" id="text-1-5-17">
<p>
Replaces error with given value; can be used to customize error messages.
</p>
</div>
</li>
