docs/howto/binding.org
*** ~chain( ext, ... )~

Creates a single translator from a list of translators.

*** ~fn( f )~

Creates an translator which calls function ~f~ on the value, then produces the
return value as a result.  Discussed in next section.

* Creating translators from functions

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/fnext.html :padline no
<table id="ex2">
  <tr>
    <td></td>
    <td>
      <input type="text" data-bind="hd.num( x )"/> &gt; 10 &rArr;
      <span data-bind="hd.text( x, hd.fn( gt10 ) )"></span> (ref:usefn1)
    </td>
  </tr><tr>
    <td>10 &le;&nbsp;</td>
    <td>
      <input type="text" data-bind="hd.num( y )"/> &le; 20 &rArr;
      <span id="y_view" data-bind="hd.text( y, hd.fn( range, 10, 20 ) )"><span> (ref:usefn2)
    </td>
  </tr>
</table>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/fnext.js :padline no
var model = new hd.ModelBuilder()
    .v( 'x', 3 )
    .v( 'y', 13 )
    .end();
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/fnext.js :padline no
// Global function
gt10 = function gt10( x ) { (ref:fn1)
  return x > 10 ? 'Yes!' : 'No!';
}

// Global function
range = function range( begin, end, x ) { (ref:fn2)
  return (x >= begin && x <= end) ? 'Yes!' : 'No!';
}

window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex2' ) );
} )
#+END_SRC

/Results/

#+HTML: <div class="results">
#+INCLUDE: tangle/fnext.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+HTML: (function() {
#+INCLUDE: tangle/fnext.js html
#+HTML: })();
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
This example creates two translators from functions in order to translate the
values displayed in the web page.
#+HTML: </div>

** The ~fn~ translator

Translators are actually objects which conform to a certain interface.  You can
define your own translator types as JavaScript objects.  However, in cases
where you need to do a simple translation, there's an easier way:

*** Write a translation function

A translation function is a function which takes the incoming value as a
parameter, then returns the translated value as the result.  For example, the
function ~gt10~ on [[(fn1)][line (fn1)]] of the binding section takes a numeric value and
translates it to the string "~Yes!~" if it is greater than 10, and the string
"~No!~" otherwise.

If your translation fails, your translation function should throw an
error value as an exception.  This will be caught and passed on as an error
value.

Note that, if you want to, you can write an anonymous translation function
directly into the binding specification.  The
[[http://wiki.ecmascript.org/doku.php?id=harmony:specification_drafts][draft for EcmaScript 6]] includes an arrow notation for anonymous functions,
which would allow such inline functions to be even more convenient.


*** Use it in a ~fn~ translator

The ~hd.fn~ translator takes a translation function as a parameter.  Then,
when it receives a value, it invokes the translation function, and passes
the result on.  We used the ~gt10~ function in the binding specification found
in the view section on [[(usefn1)][line (usefn1)]].  Thus, the value displayed in the
~<span>~ tag is not the numeric value of ~x~, but the string returned by
passing that to ~gt10~.

** Extra function parameters

You may want your translation function to take some extra parameters that
configure its behavior.  For example, the function ~range~ in [[(fn2)][line (fn2)]] of
the binding section takes a ~begin~ and ~end~ parameter to specify the range
to test.  Any extra parameters passed to ~hd.fn~ (after the function itself)
will be passed directly to the function when it is called.  These extra
parameters should be the first parameters of the function, with the value to
be translated as the final parameter.  You can see this in [[(usefn2)][line (usefn2)]] of
the view section.

* View adapters

