howto/binding.html

<li><a id="sec-1-5-18"></a><code>chain( ext, ... )</code><br  /><div class="outline-text-4" id="text-1-5-18">
<p>
Creates a single translator from a list of translators.
</p>
</div>
</li>

<li><a id="sec-1-5-19"></a><code>fn( f )</code><br  /><div class="outline-text-4" id="text-1-5-19">
<p>
Creates an translator which calls function <code>f</code> on the value, then produces the
return value as a result.  Discussed in next section.
</p>
</div>
</li></ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Creating translators from functions</h2>
<div class="outline-text-2" id="text-2">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr"> 1: </span>&lt;<span style="color: #006699;">table</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex2"</span>&gt;
<span class="linenr"> 2: </span>  &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 3: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 4: </span>    &lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 5: </span>      &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( x )"</span>/&gt; <span style="color: #BA36A5;">&amp;gt;</span> 10 <span style="color: #BA36A5;">&amp;rArr;</span>
<span id="coderef-usefn1" class="coderef-off"><span class="linenr"> 6: </span>      &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( x, hd.fn( gt10 ) )"</span>&gt;&lt;/<span style="color: #006699;">span</span>&gt;</span>
<span class="linenr"> 7: </span>    &lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 8: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 9: </span>    &lt;<span style="color: #006699;">td</span>&gt;10 <span style="color: #BA36A5;">&amp;le;&amp;nbsp;</span>&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">10: </span>    &lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr">11: </span>      &lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( y )"</span>/&gt; <span style="color: #BA36A5;">&amp;le;</span> 20 <span style="color: #BA36A5;">&amp;rArr;</span>
<span id="coderef-usefn2" class="coderef-off"><span class="linenr">12: </span>      &lt;<span style="color: #006699;">span</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"y_view"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( y, hd.fn( range, 10, 20 ) )"</span>&gt;&lt;<span style="color: #006699;">span</span>&gt;</span>
<span class="linenr">13: </span>    &lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">14: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">15: </span>&lt;/<span style="color: #006699;">table</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr">2: </span>    .v( <span style="color: #008000;">'x'</span>, 3 )
<span class="linenr">3: </span>    .v( <span style="color: #008000;">'y'</span>, 13 )
<span class="linenr">4: </span>    .end();
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr"> 1: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Global function</span>
<span id="coderef-fn1" class="coderef-off"><span class="linenr"> 2: </span>gt10 = <span style="color: #0000FF;">function</span> gt10( <span style="color: #BA36A5;">x</span> ) {</span>
<span class="linenr"> 3: </span>  <span style="color: #0000FF;">return</span> x &gt; 10 ? <span style="color: #008000;">'Yes!'</span> : <span style="color: #008000;">'No!'</span>;
<span class="linenr"> 4: </span>}
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #8D8D84;">// </span><span style="color: #8D8D84; font-style: italic;">Global function</span>
<span id="coderef-fn2" class="coderef-off"><span class="linenr"> 7: </span>range = <span style="color: #0000FF;">function</span> range( <span style="color: #BA36A5;">begin</span>, <span style="color: #BA36A5;">end</span>, <span style="color: #BA36A5;">x</span> ) {</span>
<span class="linenr"> 8: </span>  <span style="color: #0000FF;">return</span> (x &gt;= begin &amp;&amp; x &lt;= end) ? <span style="color: #008000;">'Yes!'</span> : <span style="color: #008000;">'No!'</span>;
<span class="linenr"> 9: </span>}
<span class="linenr">10: </span>
<span class="linenr">11: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">12: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex2'</span> ) );
<span class="linenr">13: </span>} )
</pre>
</div>

<p>
<i>Results</i>
</p>

<div class="results">
<table id="ex2">
  <tr>
    <td></td>
    <td>
      <input type="text" data-bind="hd.num( x )"/> &gt; 10 &rArr;
      <span data-bind="hd.text( x, hd.fn( gt10 ) )"></span> 
    </td>
  </tr><tr>
    <td>10 &le;&nbsp;</td>
    <td>
      <input type="text" data-bind="hd.num( y )"/> &le; 20 &rArr;
      <span id="y_view" data-bind="hd.text( y, hd.fn( range, 10, 20 ) )"><span> 
    </td>
  </tr>
</table>
</div>
<script type="text/javascript">
(function() {
var model = new hd.ModelBuilder()
    .v( 'x', 3 )
    .v( 'y', 13 )
    .end();
// Global function
gt10 = function gt10( x ) { 
  return x > 10 ? 'Yes!' : 'No!';
}

// Global function
range = function range( begin, end, x ) { 
  return (x >= begin && x <= end) ? 'Yes!' : 'No!';
}

window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex2' ) );
} )
})();
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
This example creates two translators from functions in order to translate the
values displayed in the web page.
</p>
</div>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The <code>fn</code> translator</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Translators are actually objects which conform to a certain interface.  You can
define your own translator types as JavaScript objects.  However, in cases
where you need to do a simple translation, there's an easier way:
</p>
</div>

<ol class="org-ol"><li><a id="sec-2-1-1"></a>Write a translation function<br  /><div class="outline-text-4" id="text-2-1-1">
<p>
A translation function is a function which takes the incoming value as a
parameter, then returns the translated value as the result.  For example, the
function <code>gt10</code> on <a href="#coderef-fn1"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fn1');" onmouseout="CodeHighlightOff(this, 'coderef-fn1');">line 2</a> of the binding section takes a numeric value and
translates it to the string "<code>Yes!</code>" if it is greater than 10, and the string
"<code>No!</code>" otherwise.
</p>

<p>
If your translation fails, your translation function should throw an
error value as an exception.  This will be caught and passed on as an error
value.
</p>

<p>
Note that, if you want to, you can write an anonymous translation function
directly into the binding specification.  The
<a href="http://wiki.ecmascript.org/doku.php?id=harmony:specification_drafts">draft for EcmaScript 6</a> includes an arrow notation for anonymous functions,
which would allow such inline functions to be even more convenient.
</p>
</div>
</li>


<li><a id="sec-2-1-2"></a>Use it in a <code>fn</code> translator<br  /><div class="outline-text-4" id="text-2-1-2">
<p>
The <code>hd.fn</code> translator takes a translation function as a parameter.  Then,
when it receives a value, it invokes the translation function, and passes
the result on.  We used the <code>gt10</code> function in the binding specification found
in the view section on <a href="#coderef-usefn1"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-usefn1');" onmouseout="CodeHighlightOff(this, 'coderef-usefn1');">line 6</a>.  Thus, the value displayed in the
<code>&lt;span&gt;</code> tag is not the numeric value of <code>x</code>, but the string returned by
passing that to <code>gt10</code>.
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Extra function parameters</h3>
<div class="outline-text-3" id="text-2-2">
<p>
You may want your translation function to take some extra parameters that
configure its behavior.  For example, the function <code>range</code> in <a href="#coderef-fn2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-fn2');" onmouseout="CodeHighlightOff(this, 'coderef-fn2');">line 7</a> of
the binding section takes a <code>begin</code> and <code>end</code> parameter to specify the range
to test.  Any extra parameters passed to <code>hd.fn</code> (after the function itself)
will be passed directly to the function when it is called.  These extra
parameters should be the first parameters of the function, with the value to
be translated as the final parameter.  You can see this in <a href="#coderef-usefn2"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-usefn2');" onmouseout="CodeHighlightOff(this, 'coderef-usefn2');">line 12</a> of
the view section.
</p>
</div>
</div>
</div>
