docs/howto/binding.org
** What view adapters do

As described in the [[file:basics.org][Basic HotDrink Usage]] document, a binding connects an
element of the view with an element of the model so that changes in one will
be reflected in the other.  In order to do this, we need an object that
represents the view and which supports the interface HotDrink expects.  This
object is called a view adapter.  We will define the interfaces used in the
[[file:program.org][Programming Guide]], but for now we simply list the adapters that we provide
with HotDrink.

There are two interfaces which a view adapter may use:  one for sending values
to the view-model, and one for receiving values from the model.  We say that a
adapter which only receives values is a /read-only/ adapter, an adapter which
only sends values is a /write-only/ adapter, and an adapter which does both is
a /read-write/ adapter.

Most adapter types take a single parameter upon construction:  an HTML DOM
element node for the view element to be encapsulated.  There is currently only
one that takes additional parameters; there are two which don't require a DOM
element because they do not encapsulate a specific DOM node.

This example showcases the adapters that are currently available in HotDrink.
As the focus of HotDrink is on view-model behavior, the number of adapters we
have developed is relatively small.  We expect to add to this collection as
time goes on.  In the meantime, we have tried to make adding adapters to
HotDrink as simple as possible so that, if we don't have the adapter you need,
you can easily write it yourself.  For more information, see the HotDrink
[[file:program.org][Programming Guide]].

** List of adapters

Here are the adapters provided by HotDrink.

*** ~Value( el )~

This adapter uses the value of the variable as the ~value~ property of the
corresponding element.  This adapter is well suited for ~<select>~ tags, like
the one on [[(select)][line (select)]] of the view section.  You may also use it for
text-editing inputs, as on [[(value)][line (value)]] of the view section, though ~bindEdit~
is probably a better choice.

This is a read-write adapter.

*** ~Edit( el )~

This adapter also uses the value of the variable as the ~value~ property
of the tag, but it has some additional behaviors to make it work well with text
editing.  In particular:

- When the input is edited, the ~edit~ binding waits a fraction of a second
  before changing its variable in case any more changes are made.  If so, the
  binding discards the previous edit.  This is nice when the user is typing
  something --- to update the GUI after every keystroke would be distracting.

- If the value of the variable changes while the user is editing, the ~edit~
  binding remembers the new value, but does not set it until the edit box
  loses focus.  This might happen, for example, if the binding converts the
  value to some canonical form.

We used the edit binding for the text box in [[(edit)][line (edit)]] of the view section.
Compare it's behavior to the value binding.  (Try typing "1e10" into both to
see what happens.)

This is a read-write adapter.

*** ~Checked( el )~

This adapter uses a Boolean value as the ~checked~ property on a check-box.

This is a read-write binding: checking or un-checking the check-box updates
the variable.

*** ~Enabled( el )~

This adapter uses a Boolean value to determine whether or not a widget is
enabled --- a ~true~ value means enabled, a ~false~ value means disabled.
Later on we'll show you how this can be used to automatically disable
variables which become irrelevant.

This is a read-only adapter: explicitly enabling or disabling the widget will
/not/ affect the value of the variable.

*** ~CssClass( ontrue, onfalse, el )~

This adapter uses a Boolean value to determine whether or not the given CSS
class name should be applied to the view element.  Notice that this
constructor takes additional parameters.  If the boolean value is true, then
the ~ontrue~ class will be added to the element.  If it is false, then the
~onfalse~ class will be added to the element.

Both ~ontrue~ and ~onfalse~ may be ~null~; if so, then the adapter simply will
not add a class for the corresponding value.  You can see, the binding on [[(justtrue)][line
(justtrue)]] of the binding section specifies both, whereas the binding on [[(truefalse)][line
(truefalse)]] of the binding section only specifies a class to add when the
value is true.

This is a read-only binding: explicitly setting the element's class name will
/not/ update the variable.

*** ~Text( el )~

This adapter replaces the contents of the tag with the value of the variable.
Note that the value is treated as text, /not/ as HTML; any HTML tags or
entities in the value will simply be displayed as text.

This is a read-only binding:  explicitly changing the contents of the tag will
/not/ update the variable.

*** ~Time( update_ms )~

This adapter writes the current time to the variable every ~update_ms~
milliseconds.  The time is given as a JavaScript ~Date~ object.

This is a write-only binding:  changing the contents of the variable will have
no effect on the time.

*** ~MousePosition()~

This adapter writes the current mouse position to the variable every time the
mouse moves.  The position is given as a JavaScript object with an ~x~ and ~y~
property.

This is a write-only binding:  changing the contents of the variable will have
no effect on the mouse position.

*** ~Position( el )~

This adapter takes a point (an object with an ~x~ and ~y~ property) and uses
it to set the element's CSS ~left~ and ~top~ properties.  The adapter will
also set the element's CSS ~position~ property to ~absolute~.

This is a read-only binding: changing the position or the style of the element
will /not/ update the variable.

