howto/binding.html

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> What view adapters do</h3>
<div class="outline-text-3" id="text-3-2">
<p>
As described in the <a href="basics.html">Basic HotDrink Usage</a> document, a binding connects an
element of the view with an element of the model so that changes in one will
be reflected in the other.  In order to do this, we need an object that
represents the view and which supports the interface HotDrink expects.  This
object is called a view adapter.  We will define the interfaces used in the
<a href="program.html">Programming Guide</a>, but for now we simply list the adapters that we provide
with HotDrink.
</p>

<p>
There are two interfaces which a view adapter may use:  one for sending values
to the view-model, and one for receiving values from the model.  We say that a
adapter which only receives values is a <i>read-only</i> adapter, an adapter which
only sends values is a <i>write-only</i> adapter, and an adapter which does both is
a <i>read-write</i> adapter.
</p>

<p>
Most adapter types take a single parameter upon construction:  an HTML DOM
element node for the view element to be encapsulated.  There is currently only
one that takes additional parameters; there are two which don't require a DOM
element because they do not encapsulate a specific DOM node.
</p>

<p>
This example showcases the adapters that are currently available in HotDrink.
As the focus of HotDrink is on view-model behavior, the number of adapters we
have developed is relatively small.  We expect to add to this collection as
time goes on.  In the meantime, we have tried to make adding adapters to
HotDrink as simple as possible so that, if we don't have the adapter you need,
you can easily write it yourself.  For more information, see the HotDrink
<a href="program.html">Programming Guide</a>.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> List of adapters</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Here are the adapters provided by HotDrink.
</p>
</div>

<ol class="org-ol"><li><a id="sec-3-3-1"></a><code>Value( el )</code><br  /><div class="outline-text-4" id="text-3-3-1">
<p>
This adapter uses the value of the variable as the <code>value</code> property of the
corresponding element.  This adapter is well suited for <code>&lt;select&gt;</code> tags, like
the one on <a href="#coderef-select"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-select');" onmouseout="CodeHighlightOff(this, 'coderef-select');">line 9</a> of the view section.  You may also use it for
text-editing inputs, as on <a href="#coderef-value"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-value');" onmouseout="CodeHighlightOff(this, 'coderef-value');">line 15</a> of the view section, though <code>bindEdit</code>
is probably a better choice.
</p>

<p>
This is a read-write adapter.
</p>
</div>
</li>

<li><a id="sec-3-3-2"></a><code>Edit( el )</code><br  /><div class="outline-text-4" id="text-3-3-2">
<p>
This adapter also uses the value of the variable as the <code>value</code> property
of the tag, but it has some additional behaviors to make it work well with text
editing.  In particular:
</p>

<ul class="org-ul">
<li>When the input is edited, the <code>edit</code> binding waits a fraction of a second
before changing its variable in case any more changes are made.  If so, the
binding discards the previous edit.  This is nice when the user is typing
something &#x2014; to update the GUI after every keystroke would be distracting.
</li>

<li>If the value of the variable changes while the user is editing, the <code>edit</code>
binding remembers the new value, but does not set it until the edit box
loses focus.  This might happen, for example, if the binding converts the
value to some canonical form.
</li>
</ul>

<p>
We used the edit binding for the text box in <a href="#coderef-edit"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-edit');" onmouseout="CodeHighlightOff(this, 'coderef-edit');">line 20</a> of the view section.
Compare it's behavior to the value binding.  (Try typing "1e10" into both to
see what happens.)
</p>

<p>
This is a read-write adapter.
</p>
</div>
</li>

<li><a id="sec-3-3-3"></a><code>Checked( el )</code><br  /><div class="outline-text-4" id="text-3-3-3">
<p>
This adapter uses a Boolean value as the <code>checked</code> property on a check-box.
</p>

<p>
This is a read-write binding: checking or un-checking the check-box updates
the variable.
</p>
</div>
</li>

<li><a id="sec-3-3-4"></a><code>Enabled( el )</code><br  /><div class="outline-text-4" id="text-3-3-4">
<p>
This adapter uses a Boolean value to determine whether or not a widget is
enabled &#x2014; a <code>true</code> value means enabled, a <code>false</code> value means disabled.
Later on we'll show you how this can be used to automatically disable
variables which become irrelevant.
</p>

<p>
This is a read-only adapter: explicitly enabling or disabling the widget will
<i>not</i> affect the value of the variable.
</p>
</div>
</li>

<li><a id="sec-3-3-5"></a><code>CssClass( ontrue, onfalse, el )</code><br  /><div class="outline-text-4" id="text-3-3-5">
<p>
This adapter uses a Boolean value to determine whether or not the given CSS
class name should be applied to the view element.  Notice that this
constructor takes additional parameters.  If the boolean value is true, then
the <code>ontrue</code> class will be added to the element.  If it is false, then the
<code>onfalse</code> class will be added to the element.
</p>

<p>
Both <code>ontrue</code> and <code>onfalse</code> may be <code>null</code>; if so, then the adapter simply will
not add a class for the corresponding value.  You can see, the binding on <a href="#coderef-justtrue"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-justtrue');" onmouseout="CodeHighlightOff(this, 'coderef-justtrue');">line
44</a> of the binding section specifies both, whereas the binding on <a href="#coderef-truefalse"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-truefalse');" onmouseout="CodeHighlightOff(this, 'coderef-truefalse');">line
51</a> of the binding section only specifies a class to add when the
value is true.
</p>

<p>
This is a read-only binding: explicitly setting the element's class name will
<i>not</i> update the variable.
</p>
</div>
</li>

<li><a id="sec-3-3-6"></a><code>Text( el )</code><br  /><div class="outline-text-4" id="text-3-3-6">
<p>
This adapter replaces the contents of the tag with the value of the variable.
Note that the value is treated as text, <i>not</i> as HTML; any HTML tags or
entities in the value will simply be displayed as text.
</p>

<p>
This is a read-only binding:  explicitly changing the contents of the tag will
<i>not</i> update the variable.
</p>
</div>
</li>

<li><a id="sec-3-3-7"></a><code>Time( update_ms )</code><br  /><div class="outline-text-4" id="text-3-3-7">
<p>
This adapter writes the current time to the variable every <code>update_ms</code>
milliseconds.  The time is given as a JavaScript <code>Date</code> object.
</p>

<p>
This is a write-only binding:  changing the contents of the variable will have
no effect on the time.
</p>
</div>
</li>

<li><a id="sec-3-3-8"></a><code>MousePosition()</code><br  /><div class="outline-text-4" id="text-3-3-8">
<p>
This adapter writes the current mouse position to the variable every time the
mouse moves.  The position is given as a JavaScript object with an <code>x</code> and <code>y</code>
property.
</p>

<p>
This is a write-only binding:  changing the contents of the variable will have
no effect on the mouse position.
</p>
</div>
</li>

<li><a id="sec-3-3-9"></a><code>Position( el )</code><br  /><div class="outline-text-4" id="text-3-3-9">
<p>
This adapter takes a point (an object with an <code>x</code> and <code>y</code> property) and uses
it to set the element's CSS <code>left</code> and <code>top</code> properties.  The adapter will
also set the element's CSS <code>position</code> property to <code>absolute</code>.
</p>

<p>
This is a read-only binding: changing the position or the style of the element
will <i>not</i> update the variable.
</p>
</div>
</li></ol>
</div>
