docs/howto/binding.org
** Factory functions

As described in the [[file:basics.org][Basic HotDrink Usage]] document, factory functions are
simply helpers which generate binding specifications for you.  We have
included factories for the specifications we think will be most common.
However, you are encouraged to create and use your own if the provided
factories do not meet your needs.

When using declarative binding, the format of the ~data-bind~ attribute is a
comma-delimited list of binding specifications.  In order to allow factory
functions to generate multiple binding specifications, we make the following
accommodation: the list of specifications will be /flattened/ --- that is, if
an array is found in the list, the contents of the array will be interpolated
into the list in place of the array.  This flattening is repeated until there
are no more arrays in the list; thus arrays can be arbitrarily nested.

** List of factories

*** value( model, toView?, toModel? )

Use the ~Value~ adapter with optional ~toView~ and ~toModel~ arguments.

#+BEGIN_HTML
<pre class="results">
hd.value( <i>model</i>, <i>toView</i>, <i>toModel</i> )
  ==
{mkview:  hd.Value,
 model:   <i>model</i>,
 toView:  <i>toView</i>,
 toModel: <i>toModel</i>
}
</pre>
#+END_HTML

*** edit( model, toView?, toModel? )

Use the ~Edit~ adapter with optional ~toView~ and ~toModel~ arguments.

#+BEGIN_HTML
<pre class="results">
hd.edit( <i>model</i>, <i>toView</i>, <i>toModel</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toView:  <i>toView</i>,
 toModel: <i>toModel</i>
}
</pre>
#+END_HTML

*** number( model )

Use the ~Edit~ adapter where the variable holds a number.  Note that no
~toView~ is needed, as JavaScript will automatically convert a number to a
string when needed.

#+BEGIN_HTML
<pre class="results">
hd.num( <i>model</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toModel: hd.toNum()
}
</pre>
#+END_HTML

*** number( model, places, toView?, toModel? )

This overloaded form of ~number~ will round the number to a specified number
of digits after the decimal point.  Note that the ~toView~ and ~toModel~
specified here should treat the view as if it is a number, not a string.  For
example, the following specification will round to two places after the
decimal point and the value showed in the view will be 100 times the value in
the model.

#+BEGIN_HTML
<pre class="results">
hd.num( <i>model</i>, 2, hd.scale( 100 ), hd.scale( 0.01 ) );
</pre>
#+END_HTML

*** date( model )

Use the ~Edit~ adapter where the variable holds a ~Date~ object.

#+BEGIN_HTML
<pre class="results">
hd.date( <i>model</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toView:  hd.dateToDateStr(),
 toModel: hd.toDate()
}
</pre>
#+END_HTML

*** date( model, toView, toModel )

This overloaded form of ~date~ allows an additional ~toView~ and ~toModel~
transformation.  Note that these transformations hsould treat the view as if
it is a date, not a string.  For example, the following specification will let
the user enter a date, but will store it in the model as the number of
milliseconds after the epoch.

#+BEGIN_HTML
<pre class="results">
hd.date( <i>model</i>, hd.dateToMilliseconds(), hd.toDate() );
</pre>
#+END_HTML

*** checked( model, toView?, toModel? )

Use the ~Checked~ adapter with optional ~toView~ and ~toModel~ arguments.

#+BEGIN_HTML
<pre class="results">
hd.checked( <i>model</i>, <i>toView</i>, <i>toModel</i> )
  ==
{mkview:  hd.Checked,
 model:   <i>model</i>,
 toView:  <i>toView</i>,
 toModel: <i>toModel</i>
}
</pre>
#+END_HTML

*** enabled( model, toView? )

Use the ~Enabled~ adapter with optional ~toView~ argument.

#+BEGIN_HTML
<pre class="results">
hd.enabled( <i>model</i>, <i>toView</i> )
  ==
{mkview:  hd.Enabled,
 model:   <i>model</i>,
 toView:  <i>toView</i>
}
</pre>
#+END_HTML

*** cssClass( model, ontrue, onfalse, toView? )

Use the ~CssClass~ adapter with optional ~toView~ argument.

Note that the ~ontrue~ and ~onfalse~ values are bound to the ~CssClass~
constructor to create a constructor requiring only a single argument.  If you
don't want to specify a class for ~ontrue~ (or ~onfalse~) you may use the
empty string or ~null~.

#+BEGIN_HTML
<pre class="results">
hd.cssClass( <i>model</i>, <i>ontrue</i>, <i>onfalse</i>, <i>toView</i> )
  ==
{mkview:  hd.CssClass.bind( null, <i>ontrue</i>, <i>onfalse</i> ),
 model:   <i>model</i>,
 toView:  <i>toView</i>
}
</pre>
#+END_HTML

*** cssClass( model )

This overloaded form of ~cssClass~ takes a variable and generates multiple
binding specifications which bind several CSS classes to various variable
properties.  For more information on binding to variable properties, see the
section "[[* Binding to variable properties][Binding to variable properties]]".

#+BEGIN_HTML
<pre class="results">
hd.cssClass( <i>variable</i> )
  ==
[cssClass( <i>variable</i>.source,        <span style="color: #a0522d;">'source'</span>,       <span style="color: #a0522d;">'derived'</span>         ),
 cssClass( <i>variable</i>.pending,       <span style="color: #a0522d;">'pending'</span>,      <span style="color: #a0522d;">'complete'</span>        ),
 cssClass( <i>variable</i>.constributing, <span style="color: #a0522d;">'contributing'</span>, <span style="color: #a0522d;">'noncontributing'</span> ),
 cssClass( <i>variable</i>.error,         <span style="color: #a0522d;">'error'</span>,         <span style="color: #8b1a1a;">null</span>             )
];
</pre>
#+END_HTML


*** text( model, toView? )

Use the ~Text~ adapter with optional ~toView~ argument.

#+BEGIN_HTML
<pre class="results">
hd.text( <i>model</i>, <i>toView</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toView:  <i>toView</i>
}
</pre>
#+END_HTML

*** editVar( model, toView?, toModel? )

This single factory function is a shortcut for invoking three different
factories on a variable.

#+BEGIN_HTML
<pre class="results">
hd.editVar( <i>model</i>, <i>toView</i>, <i>toModel</i> )
 ==
[hd.edit( <i>model</i>, <i>toView</i>, <i>toModel</i> ),
 hd.cssClass( <i>model</i> ),
 hd.enabled( <i>model</i>.relevant )
]
</pre>
#+END_HTML

*** numVar( model, places?, toview?, toModel? )

This single factory function is a shortcut for invoking three different
factories on a variable.

#+BEGIN_HTML
<pre class="results">
hd.numVar( <i>model</i>, <i>places</i>, <i>toView</i>, <i>toModel</i> )
 ==
[hd.num( <i>model</i>, <i>places</i>, <i>toView</i>, <i>toModel</i> ),
 hd.cssClass( <i>model</i> ),
 hd.enabled( <i>model</i>.relevant )
]
</pre>
#+END_HTML

*** dateVar( model, toView?, toModel? )

This single factory function is a shortcut for invoking three different
factories on a variable.

#+BEGIN_HTML
<pre class="results">
hd.dateVar( <i>model</i>, <i>toView</i>, <i>toModel</i> )
 ==
[hd.edit( <i>model</i>, <i>toView</i>, <i>toModel</i> ),
 hd.cssClass( <i>model</i> ),
 hd.enabled( <i>model</i>.relevant )
]
</pre>
#+END_HTML

