howto/binding.html

<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Factory functions</h3>
<div class="outline-text-3" id="text-3-4">
<p>
As described in the <a href="basics.html">Basic HotDrink Usage</a> document, factory functions are
simply helpers which generate binding specifications for you.  We have
included factories for the specifications we think will be most common.
However, you are encouraged to create and use your own if the provided
factories do not meet your needs.
</p>

<p>
When using declarative binding, the format of the <code>data-bind</code> attribute is a
comma-delimited list of binding specifications.  In order to allow factory
functions to generate multiple binding specifications, we make the following
accommodation: the list of specifications will be <i>flattened</i> &#x2014; that is, if
an array is found in the list, the contents of the array will be interpolated
into the list in place of the array.  This flattening is repeated until there
are no more arrays in the list; thus arrays can be arbitrarily nested.
</p>
</div>
</div>

<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> List of factories</h3>
<div class="outline-text-3" id="text-3-5">
</div><ol class="org-ol"><li><a id="sec-3-5-1"></a>value( model, toView?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-1">
<p>
Use the <code>Value</code> adapter with optional <code>toView</code> and <code>toModel</code> arguments.
</p>

<pre class="results">
hd.value( <i>model</i>, <i>toView</i>, <i>toModel</i> )
  ==
{mkview:  hd.Value,
 model:   <i>model</i>,
 toView:  <i>toView</i>,
 toModel: <i>toModel</i>
}
</pre>
</div>
</li>

<li><a id="sec-3-5-2"></a>edit( model, toView?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-2">
<p>
Use the <code>Edit</code> adapter with optional <code>toView</code> and <code>toModel</code> arguments.
</p>

<pre class="results">
hd.edit( <i>model</i>, <i>toView</i>, <i>toModel</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toView:  <i>toView</i>,
 toModel: <i>toModel</i>
}
</pre>
</div>
</li>

<li><a id="sec-3-5-3"></a>number( model )<br  /><div class="outline-text-4" id="text-3-5-3">
<p>
Use the <code>Edit</code> adapter where the variable holds a number.  Note that no
<code>toView</code> is needed, as JavaScript will automatically convert a number to a
string when needed.
</p>

<pre class="results">
hd.num( <i>model</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toModel: hd.toNum()
}
</pre>
</div>
</li>

<li><a id="sec-3-5-4"></a>number( model, places, toView?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-4">
<p>
This overloaded form of <code>number</code> will round the number to a specified number
of digits after the decimal point.  Note that the <code>toView</code> and <code>toModel</code>
specified here should treat the view as if it is a number, not a string.  For
example, the following specification will round to two places after the
decimal point and the value showed in the view will be 100 times the value in
the model.
</p>

<pre class="results">
hd.num( <i>model</i>, 2, hd.scale( 100 ), hd.scale( 0.01 ) );
</pre>
</div>
</li>

<li><a id="sec-3-5-5"></a>date( model )<br  /><div class="outline-text-4" id="text-3-5-5">
<p>
Use the <code>Edit</code> adapter where the variable holds a <code>Date</code> object.
</p>

<pre class="results">
hd.date( <i>model</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toView:  hd.dateToDateStr(),
 toModel: hd.toDate()
}
</pre>
</div>
</li>

<li><a id="sec-3-5-6"></a>date( model, toView, toModel )<br  /><div class="outline-text-4" id="text-3-5-6">
<p>
This overloaded form of <code>date</code> allows an additional <code>toView</code> and <code>toModel</code>
transformation.  Note that these transformations hsould treat the view as if
it is a date, not a string.  For example, the following specification will let
the user enter a date, but will store it in the model as the number of
milliseconds after the epoch.
</p>

<pre class="results">
hd.date( <i>model</i>, hd.dateToMilliseconds(), hd.toDate() );
</pre>
</div>
</li>

<li><a id="sec-3-5-7"></a>checked( model, toView?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-7">
<p>
Use the <code>Checked</code> adapter with optional <code>toView</code> and <code>toModel</code> arguments.
</p>

<pre class="results">
hd.checked( <i>model</i>, <i>toView</i>, <i>toModel</i> )
  ==
{mkview:  hd.Checked,
 model:   <i>model</i>,
 toView:  <i>toView</i>,
 toModel: <i>toModel</i>
}
</pre>
</div>
</li>

<li><a id="sec-3-5-8"></a>enabled( model, toView? )<br  /><div class="outline-text-4" id="text-3-5-8">
<p>
Use the <code>Enabled</code> adapter with optional <code>toView</code> argument.
</p>

<pre class="results">
hd.enabled( <i>model</i>, <i>toView</i> )
  ==
{mkview:  hd.Enabled,
 model:   <i>model</i>,
 toView:  <i>toView</i>
}
</pre>
</div>
</li>

<li><a id="sec-3-5-9"></a>cssClass( model, ontrue, onfalse, toView? )<br  /><div class="outline-text-4" id="text-3-5-9">
<p>
Use the <code>CssClass</code> adapter with optional <code>toView</code> argument.
</p>

<p>
Note that the <code>ontrue</code> and <code>onfalse</code> values are bound to the <code>CssClass</code>
constructor to create a constructor requiring only a single argument.  If you
don't want to specify a class for <code>ontrue</code> (or <code>onfalse</code>) you may use the
empty string or <code>null</code>.
</p>

<pre class="results">
hd.cssClass( <i>model</i>, <i>ontrue</i>, <i>onfalse</i>, <i>toView</i> )
  ==
{mkview:  hd.CssClass.bind( null, <i>ontrue</i>, <i>onfalse</i> ),
 model:   <i>model</i>,
 toView:  <i>toView</i>
}
</pre>
</div>
</li>

<li><a id="sec-3-5-10"></a>cssClass( model )<br  /><div class="outline-text-4" id="text-3-5-10">
<p>
This overloaded form of <code>cssClass</code> takes a variable and generates multiple
binding specifications which bind several CSS classes to various variable
properties.  For more information on binding to variable properties, see the
section "<a href="#sec-4">Binding to variable properties</a>".
</p>

<pre class="results">
hd.cssClass( <i>variable</i> )
  ==
[cssClass( <i>variable</i>.source,        <span style="color: #a0522d;">'source'</span>,       <span style="color: #a0522d;">'derived'</span>         ),
 cssClass( <i>variable</i>.pending,       <span style="color: #a0522d;">'pending'</span>,      <span style="color: #a0522d;">'complete'</span>        ),
 cssClass( <i>variable</i>.constributing, <span style="color: #a0522d;">'contributing'</span>, <span style="color: #a0522d;">'noncontributing'</span> ),
 cssClass( <i>variable</i>.error,         <span style="color: #a0522d;">'error'</span>,         <span style="color: #8b1a1a;">null</span>             )
];
</pre>
</div>
</li>


<li><a id="sec-3-5-11"></a>text( model, toView? )<br  /><div class="outline-text-4" id="text-3-5-11">
<p>
Use the <code>Text</code> adapter with optional <code>toView</code> argument.
</p>

<pre class="results">
hd.text( <i>model</i>, <i>toView</i> )
  ==
{mkview:  hd.Edit,
 model:   <i>model</i>,
 toView:  <i>toView</i>
}
</pre>
</div>
</li>

<li><a id="sec-3-5-12"></a>editVar( model, toView?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-12">
<p>
This single factory function is a shortcut for invoking three different
factories on a variable.
</p>

<pre class="results">
hd.editVar( <i>model</i>, <i>toView</i>, <i>toModel</i> )
 ==
[hd.edit( <i>model</i>, <i>toView</i>, <i>toModel</i> ),
 hd.cssClass( <i>model</i> ),
 hd.enabled( <i>model</i>.relevant )
]
</pre>
</div>
</li>

<li><a id="sec-3-5-13"></a>numVar( model, places?, toview?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-13">
<p>
This single factory function is a shortcut for invoking three different
factories on a variable.
</p>

<pre class="results">
hd.numVar( <i>model</i>, <i>places</i>, <i>toView</i>, <i>toModel</i> )
 ==
[hd.num( <i>model</i>, <i>places</i>, <i>toView</i>, <i>toModel</i> ),
 hd.cssClass( <i>model</i> ),
 hd.enabled( <i>model</i>.relevant )
]
</pre>
</div>
</li>

<li><a id="sec-3-5-14"></a>dateVar( model, toView?, toModel? )<br  /><div class="outline-text-4" id="text-3-5-14">
<p>
This single factory function is a shortcut for invoking three different
factories on a variable.
</p>

<pre class="results">
hd.dateVar( <i>model</i>, <i>toView</i>, <i>toModel</i> )
 ==
[hd.edit( <i>model</i>, <i>toView</i>, <i>toModel</i> ),
 hd.cssClass( <i>model</i> ),
 hd.enabled( <i>model</i>.relevant )
]
</pre>
</div>
</li></ol>
</div>
</div>
