docs/howto/binding.org
* Binding to variable properties

/View/

#+BEGIN_SRC html -n -r :exports code :tangle tangle/prop.html :padline no
<style type="text/css">
  .source { background-color: #ffe; }
  .derived { background-color: #eee; }
  .error { border: 2px solid #f00; }
</style>
<table id="ex4" style="text-align: right">
  <tr>
    <td>Number:</td>
    <td><input type="text" data-bind="hd.num( x ),
           hd.cssClass( x.error, 'error' )"/></td>
    <td style="color: red" data-bind="hd.text( x.error )"></td>
  </tr><tr>
    <td>&nbsp;</td>
  </tr><tr>
    <td>Width:</td>
    <td><input type="text" data-bind="hd.num( width ),
           hd.cssClass( width.source, 'source', 'derived' )"/><td>
  </tr><tr>
    <td>Height:</td>
    <td><input type="text" data-bind="hd.num( height ),
           hd.cssClass( height.source, 'source', 'derived' )"/><td>
  </tr><tr>
    <td>Area:</td>
    <td><input type="text" data-bind="hd.num( area ),
           hd.cssClass( area.source, 'source', 'derived' )"/><td>
  </tr>
</table>
#+END_SRC

/View-Model/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/prop.js :padline no
var model = new hd.ModelBuilder()
  .v( 'x', 10 ).v( 'width', 8 ).v( 'height', 6 ).v( 'area' )
  .eq( 'area == width * height' )
  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
#+END_SRC

/Binding/

#+BEGIN_SRC js -n -r :exports code :tangle tangle/prop.js :padline no
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex4' ) );
} )
#+END_SRC

/Result/

#+HTML: <div class="results">
#+INCLUDE: tangle/prop.html html
#+HTML: </div>
#+HTML: <script type="text/javascript">
#+INCLUDE: tangle/prop.js html
#+HTML: </script>

/Notes/

#+HTML: <div class="notes">
Typing an invalid number into the first box gives it a red border and produces
an error message.  The variables /width/, /height/, and /area/, are related by
the constraint ~area == width * height~.  Thus, data will always flow from two
of these variables into the third.  The two source variables will be yellow,
and the third --- which is derived from the other two --- will be gray.
#+HTML: </div>

** Variable properties

You can bind to more than just a variable in the view-model; any object
conforming to a certain interface can be bound to.  (We describe this
interface later in the [[file:program.org][Programming Guide]]).  Each variable contains several
properties which conform to this interface, and thus can be bound to by the
view.

It is important to note that these properties are read-only.  Thus, they
should only be used with read-only adapters, such as ~text~ and ~cssClass~, and
never with read-write adapters, such as ~Edit~.

** List of variable properties

Although we list all properties here, some of them will not be fully explained
here.  They will be, however, in other documentation.

*** error

This property contains any error that was generated the last time the variable
was set --- whether by the view or by a method.  In particular, note that any
exceptions thrown by translators will be stored in this property.

If no error was generated for the variable, the value of this property will be
~null~.  Note that, using normal JavaScript semantics, you may use this
property as a Boolean value: an object or non-empty string will naturally
evaluate to ~true~, and ~null~ or the empty string will evaluate to ~false~.

*** source

This Boolean property is true if the variable was a /source/ (kept its value)
during the last evaluation, and false if it was /derived/ (received a new
value from a method).

*** pending

This Boolean property is true if the variable is currently waiting for an
update from an asynchronous method, and false if it is not.  For more
information, see [[file:async.org][Asynchronous Methods]].

*** contributing

This Boolean property is true if the value of the variable was used to compute
an output variable, and false if it was not.  For more information, see [[file:async.org][Asynchronous Methods]].

*** relevant

This Boolean property is true if editing the variable may cause a change to an
output variable, and false if not.  For more information, see [[file:async.org][Asynchronous Methods]].

