howto/binding.html

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Binding to variable properties</h2>
<div class="outline-text-2" id="text-4">
<p>
<i>View</i>
</p>

<div class="org-src-container">

<pre class="src src-html"><span class="linenr"> 1: </span>&lt;<span style="color: #006699;">style</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text/css"</span>&gt;
<span class="linenr"> 2: </span>  .source { background-color: #ffe; }
<span class="linenr"> 3: </span>  .derived { background-color: #eee; }
<span class="linenr"> 4: </span>  .error { border: 2px solid #f00; }
<span class="linenr"> 5: </span>&lt;/<span style="color: #006699;">style</span>&gt;
<span class="linenr"> 6: </span>&lt;<span style="color: #006699;">table</span> <span style="color: #BA36A5;">id</span>=<span style="color: #008000;">"ex4"</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"text-align: right"</span>&gt;
<span class="linenr"> 7: </span>  &lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr"> 8: </span>    &lt;<span style="color: #006699;">td</span>&gt;Number:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr"> 9: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( x ),</span>
<span class="linenr">10: </span><span style="color: #008000;">           hd.cssClass( x.error, 'error' )"</span>/&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">11: </span>    &lt;<span style="color: #006699;">td</span> <span style="color: #BA36A5;">style</span>=<span style="color: #008000;">"color: red"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.text( x.error )"</span>&gt;&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">12: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">13: </span>    &lt;<span style="color: #006699;">td</span>&gt;<span style="color: #BA36A5;">&amp;nbsp;</span>&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">14: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">15: </span>    &lt;<span style="color: #006699;">td</span>&gt;Width:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">16: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( width ),</span>
<span class="linenr">17: </span><span style="color: #008000;">           hd.cssClass( width.source, 'source', 'derived' )"</span>/&gt;&lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr">18: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">19: </span>    &lt;<span style="color: #006699;">td</span>&gt;Height:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">20: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( height ),</span>
<span class="linenr">21: </span><span style="color: #008000;">           hd.cssClass( height.source, 'source', 'derived' )"</span>/&gt;&lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr">22: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;&lt;<span style="color: #006699;">tr</span>&gt;
<span class="linenr">23: </span>    &lt;<span style="color: #006699;">td</span>&gt;Area:&lt;/<span style="color: #006699;">td</span>&gt;
<span class="linenr">24: </span>    &lt;<span style="color: #006699;">td</span>&gt;&lt;<span style="color: #006699;">input</span> <span style="color: #BA36A5;">type</span>=<span style="color: #008000;">"text"</span> <span style="color: #BA36A5;">data-bind</span>=<span style="color: #008000;">"hd.num( area ),</span>
<span class="linenr">25: </span><span style="color: #008000;">           hd.cssClass( area.source, 'source', 'derived' )"</span>/&gt;&lt;<span style="color: #006699;">td</span>&gt;
<span class="linenr">26: </span>  &lt;/<span style="color: #006699;">tr</span>&gt;
<span class="linenr">27: </span>&lt;/<span style="color: #006699;">table</span>&gt;
</pre>
</div>

<p>
<i>View-Model</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">model</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ModelBuilder</span>()
<span class="linenr">2: </span>  .v( <span style="color: #008000;">'x'</span>, 10 ).v( <span style="color: #008000;">'width'</span>, 8 ).v( <span style="color: #008000;">'height'</span>, 6 ).v( <span style="color: #008000;">'area'</span> )
<span class="linenr">3: </span>  .eq( <span style="color: #008000;">'area == width * height'</span> )
<span class="linenr">4: </span>  .end();
<span class="linenr">5: </span>
<span class="linenr">6: </span><span style="color: #0000FF;">var</span> <span style="color: #BA36A5;">system</span> = <span style="color: #0000FF;">new</span> <span style="color: #6434A3;">hd.ConstraintSystem</span>();
<span class="linenr">7: </span>system.addComponent( model );
</pre>
</div>

<p>
<i>Binding</i>
</p>

<div class="org-src-container">

<pre class="src src-js"><span class="linenr">1: </span>window.addEventListener( <span style="color: #008000;">'load'</span>, <span style="color: #0000FF;">function</span>() {
<span class="linenr">2: </span>  hd.performDeclaredBindings( model, document.getElementById( <span style="color: #008000;">'ex4'</span> ) );
<span class="linenr">3: </span>} )
</pre>
</div>

<p>
<i>Result</i>
</p>

<div class="results">
<style type="text/css">
  .source { background-color: #ffe; }
  .derived { background-color: #eee; }
  .error { border: 2px solid #f00; }
</style>
<table id="ex4" style="text-align: right">
  <tr>
    <td>Number:</td>
    <td><input type="text" data-bind="hd.num( x ),
           hd.cssClass( x.error, 'error' )"/></td>
    <td style="color: red" data-bind="hd.text( x.error )"></td>
  </tr><tr>
    <td>&nbsp;</td>
  </tr><tr>
    <td>Width:</td>
    <td><input type="text" data-bind="hd.num( width ),
           hd.cssClass( width.source, 'source', 'derived' )"/><td>
  </tr><tr>
    <td>Height:</td>
    <td><input type="text" data-bind="hd.num( height ),
           hd.cssClass( height.source, 'source', 'derived' )"/><td>
  </tr><tr>
    <td>Area:</td>
    <td><input type="text" data-bind="hd.num( area ),
           hd.cssClass( area.source, 'source', 'derived' )"/><td>
  </tr>
</table>
</div>
<script type="text/javascript">
var model = new hd.ModelBuilder()
  .v( 'x', 10 ).v( 'width', 8 ).v( 'height', 6 ).v( 'area' )
  .eq( 'area == width * height' )
  .end();

var system = new hd.ConstraintSystem();
system.addComponent( model );
window.addEventListener( 'load', function() {
  hd.performDeclaredBindings( model, document.getElementById( 'ex4' ) );
} )
</script>

<p>
<i>Notes</i>
</p>

<div class="notes">
<p>
Typing an invalid number into the first box gives it a red border and produces
an error message.  The variables <i>width</i>, <i>height</i>, and <i>area</i>, are related by
the constraint <code>area == width * height</code>.  Thus, data will always flow from two
of these variables into the third.  The two source variables will be yellow,
and the third &#x2014; which is derived from the other two &#x2014; will be gray.
</p>
</div>
</div>

<div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Variable properties</h3>
<div class="outline-text-3" id="text-4-1">
<p>
You can bind to more than just a variable in the view-model; any object
conforming to a certain interface can be bound to.  (We describe this
interface later in the <a href="program.html">Programming Guide</a>).  Each variable contains several
properties which conform to this interface, and thus can be bound to by the
view.
</p>

<p>
It is important to note that these properties are read-only.  Thus, they
should only be used with read-only adapters, such as <code>text</code> and <code>cssClass</code>, and
never with read-write adapters, such as <code>Edit</code>.
</p>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> List of variable properties</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Although we list all properties here, some of them will not be fully explained
here.  They will be, however, in other documentation.
</p>
</div>

<ol class="org-ol"><li><a id="sec-4-2-1"></a>error<br  /><div class="outline-text-4" id="text-4-2-1">
<p>
This property contains any error that was generated the last time the variable
was set &#x2014; whether by the view or by a method.  In particular, note that any
exceptions thrown by translators will be stored in this property.
</p>

<p>
If no error was generated for the variable, the value of this property will be
<code>null</code>.  Note that, using normal JavaScript semantics, you may use this
property as a Boolean value: an object or non-empty string will naturally
evaluate to <code>true</code>, and <code>null</code> or the empty string will evaluate to <code>false</code>.
</p>
</div>
</li>

<li><a id="sec-4-2-2"></a>source<br  /><div class="outline-text-4" id="text-4-2-2">
<p>
This Boolean property is true if the variable was a <i>source</i> (kept its value)
during the last evaluation, and false if it was <i>derived</i> (received a new
value from a method).
</p>
</div>
</li>

<li><a id="sec-4-2-3"></a>pending<br  /><div class="outline-text-4" id="text-4-2-3">
<p>
This Boolean property is true if the variable is currently waiting for an
update from an asynchronous method, and false if it is not.  For more
information, see <a href="async.html">Asynchronous Methods</a>.
</p>
</div>
</li>

<li><a id="sec-4-2-4"></a>contributing<br  /><div class="outline-text-4" id="text-4-2-4">
<p>
This Boolean property is true if the value of the variable was used to compute
an output variable, and false if it was not.  For more information, see <a href="async.html">Asynchronous Methods</a>.
</p>
</div>
</li>

<li><a id="sec-4-2-5"></a>relevant<br  /><div class="outline-text-4" id="text-4-2-5">
<p>
This Boolean property is true if editing the variable may cause a change to an
output variable, and false if not.  For more information, see <a href="async.html">Asynchronous Methods</a>.
</p>
</div>
</li>
