docs/howto/binding.org
*** value

This property contains the current value of the variable.  There should be no
reason to bind to this property, as it is the same as binding to the variable
itself, except that it is read-only.  It is listed only for completeness.
