howto/binding.html

<li><a id="sec-4-2-6"></a>value<br  /><div class="outline-text-4" id="text-4-2-6">
<p>
This property contains the current value of the variable.  There should be no
reason to bind to this property, as it is the same as binding to the variable
itself, except that it is read-only.  It is listed only for completeness.
</p>
</div>
</li></ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-03-06 Fri 16:42</p>
<p class="validation"></p>
</div>
</body>
</html>
